#+TITLE: MECH 306 Tutorial 2:
#+SUBTITLE: Random variables, Central Limit Theorem, and Error Propagation

#+PROPERTY: header-args :tangle yes
#+LATEX_HEADER: \definecolor{bg}{rgb}{0.95,0.95,0.95}
#+LATEX_HEADER: \setminted{frame=single,bgcolor=bg,samepage=true}
#+LATEX_HEADER: \setlength{\parindent}{0pt}
#+LATEX_HEADER: \usepackage{float}
#+LATEX_HEADER: \usepackage{svg}

** Analytically Deriving $\sigma_E$ (a)
For some function $f$ that takes independent variables $X_1, X_2, \ldots X_n$ where each $X$ is composed of some average value $\bar{x_n}$ with standard deviation $\sigma_{x_n}$, the expected value of $f$ and its standard deviation $\sigma_f$ are:

\[
\bar{f} = f(\bar{x}_1, \bar{x}_2, \ldots \bar{x}_n)
\]
\[
\sigma_f = \left.\sqrt{
\left(\frac{\partial f}{\partial X_1}\sigma_{x_1}\right)^2 + 
\left(\frac{\partial f}{\partial X_2}\sigma_{x_2}\right)^2 + 
\ldots + 
\left(\frac{\partial f}{\partial X_n}\sigma_{x_n}\right)^2
}
\right|_{(x_1, x_2, \ldots, x_n)}
\]

We already know the deflection formula for a simple rectangular beam:

\begin{align*}
\delta &= \frac{FL^3}{3EI} & I &= \frac{bh^3}{12}
\end{align*}

Solving for Young's modulus $E$ we get:

\[
E = \frac{4FL^3}{\delta bh^3}
\]

Let's set this up in code.
#+BEGIN_SRC matlab :session :exports code :results none
syms L h b F delta;

E = (4*F*L^3)/(delta*b*h^3);
#+END_SRC

We can now calculate the average value for $E$.

#+BEGIN_SRC matlab :session :exports code :results none
m_E = double(subs(E, {L,  h,  b,  F,  delta, }, ...
                  {m_L, m_h, m_b, m_F, m_delta}));
#+END_SRC

Now we can calculate all of the partial derivatives of $E$

#+BEGIN_SRC matlab :session :exports code :results none
dEdL = diff(E,L);
dEdh = diff(E,h);
dEdb = diff(E,b);
dEdF = diff(E,F);
dEd_delta = diff(E,delta);
#+END_SRC

Using these partial derivatives we can set up the calculation for $\sigma_E$.

#+BEGIN_SRC matlab :session :exports both :results code

syms dL dh db dF d_delta;

dE = sqrt(...
    (dEdL*dL)^2 + ...
    (dEdh*dh)^2 + ...
    (dEdb*db)^2 + ...
    (dEdF*dF)^2 + ...
    (dEd_delta*d_delta)^2);

sigma_e = double(subs(dE, {L, dL, h, dh, b, db, F, dF, delta, d_delta}, ...
           {m_L, m_dL, m_h, m_dh, m_b, m_db, m_F, m_dF, m_delta, m_d_delta}))

ans = sigma_e

#+END_SRC

#+RESULTS:
#+BEGIN_SRC matlab
3.8928e+09
#+END_SRC

#+RESULTS:
: 3.8928e+09

** Calculating Standard Deviation with a Monte Carlo Simulation (b)
Let's generate 10000 normally distributed values.

#+BEGIN_SRC matlab :session :exports code :results none
N = 10000;

n_L = m_L + m_dL*randn(1, N);
n_h = m_h + m_dh*randn(1, N);
n_b = m_b + m_db*randn(1, N);
n_F = m_F + m_dF*randn(1, N);
n_delta = m_delta + m_d_delta*randn(1, N);
#+END_SRC

Before we calculate values for $E$ we should convert the symbolic function ~E~ to a normal function for lower computation time.

#+BEGIN_SRC matlab :session :exports code :results none
f_E = matlabFunction(E)
#+END_SRC

Now we can calculate 10000 values for $E$ and find the standard deviation.

#+BEGIN_SRC matlab :session :exports code :results code
% Convert E to a standard function because
% repeated symbolic computation is really slow
n_E = f_E(n_F, n_L, n_b, n_delta, n_h)
stddev_E = std(n_E);
ans = stddev_E
#+END_SRC

#+RESULTS:
#+BEGIN_SRC matlab
4.5603e+09
#+END_SRC

#+RESULTS:
: 4.5603e+09

This value differs from the one derived analytically, but it's hard to know how significant this difference is.
To compare we will use a relative standard deviation.

#+BEGIN_SRC matlab :session :exports both :results code
rel_stddev_n_E = std(n_E)/m_E
rel_stddev_E = sigma_e/m_E
ans = [rel_stddev_n_E, rel_stddev_E]
#+END_SRC

#+RESULTS:
#+BEGIN_SRC matlab
| 0.35897 | 0.30643 |
#+END_SRC


So from the relative standard deviations we can see that the analytical and simulated results are reasonably similar.


